GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k80.inc
// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
CANCON_RO0                               equ 0F3Fh
// bitfield definitions
CANCON_RO0_FP0_POSN                      equ 0000h
CANCON_RO0_FP0_POSITION                  equ 0000h
CANCON_RO0_FP0_SIZE                      equ 0001h
CANCON_RO0_FP0_LENGTH                    equ 0001h
CANCON_RO0_FP0_MASK                      equ 0001h
CANCON_RO0_WIN0_FP1_POSN                 equ 0001h
CANCON_RO0_WIN0_FP1_POSITION             equ 0001h
CANCON_RO0_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO0_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO0_WIN0_FP1_MASK                 equ 0002h
CANCON_RO0_WIN1_FP2_POSN                 equ 0002h
CANCON_RO0_WIN1_FP2_POSITION             equ 0002h
CANCON_RO0_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO0_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO0_WIN1_FP2_MASK                 equ 0004h
CANCON_RO0_WIN2_FP3_POSN                 equ 0003h
CANCON_RO0_WIN2_FP3_POSITION             equ 0003h
CANCON_RO0_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO0_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO0_WIN2_FP3_MASK                 equ 0008h
CANCON_RO0_ABAT_POSN                     equ 0004h
CANCON_RO0_ABAT_POSITION                 equ 0004h
CANCON_RO0_ABAT_SIZE                     equ 0001h
CANCON_RO0_ABAT_LENGTH                   equ 0001h
CANCON_RO0_ABAT_MASK                     equ 0010h
CANCON_RO0_REQOP_POSN                    equ 0005h
CANCON_RO0_REQOP_POSITION                equ 0005h
CANCON_RO0_REQOP_SIZE                    equ 0003h
CANCON_RO0_REQOP_LENGTH                  equ 0003h
CANCON_RO0_REQOP_MASK                    equ 00E0h
CANCON_RO0_WIN0_POSN                     equ 0001h
CANCON_RO0_WIN0_POSITION                 equ 0001h
CANCON_RO0_WIN0_SIZE                     equ 0001h
CANCON_RO0_WIN0_LENGTH                   equ 0001h
CANCON_RO0_WIN0_MASK                     equ 0002h
CANCON_RO0_WIN1_POSN                     equ 0002h
CANCON_RO0_WIN1_POSITION                 equ 0002h
CANCON_RO0_WIN1_SIZE                     equ 0001h
CANCON_RO0_WIN1_LENGTH                   equ 0001h
CANCON_RO0_WIN1_MASK                     equ 0004h
CANCON_RO0_WIN2_POSN                     equ 0003h
CANCON_RO0_WIN2_POSITION                 equ 0003h
CANCON_RO0_WIN2_SIZE                     equ 0001h
CANCON_RO0_WIN2_LENGTH                   equ 0001h
CANCON_RO0_WIN2_MASK                     equ 0008h
CANCON_RO0_FP1_POSN                      equ 0001h
CANCON_RO0_FP1_POSITION                  equ 0001h
CANCON_RO0_FP1_SIZE                      equ 0001h
CANCON_RO0_FP1_LENGTH                    equ 0001h
CANCON_RO0_FP1_MASK                      equ 0002h
CANCON_RO0_FP2_POSN                      equ 0002h
CANCON_RO0_FP2_POSITION                  equ 0002h
CANCON_RO0_FP2_SIZE                      equ 0001h
CANCON_RO0_FP2_LENGTH                    equ 0001h
CANCON_RO0_FP2_MASK                      equ 0004h
CANCON_RO0_FP3_POSN                      equ 0003h
CANCON_RO0_FP3_POSITION                  equ 0003h
CANCON_RO0_FP3_SIZE                      equ 0001h
CANCON_RO0_FP3_LENGTH                    equ 0001h
CANCON_RO0_FP3_MASK                      equ 0008h

// Register: MDCARL
#define MDCARL MDCARL
MDCARL                                   equ 0F42h
// bitfield definitions
MDCARL_MDCL_POSN                         equ 0000h
MDCARL_MDCL_POSITION                     equ 0000h
MDCARL_MDCL_SIZE                         equ 0004h
MDCARL_MDCL_LENGTH                       equ 0004h
MDCARL_MDCL_MASK                         equ 000Fh
MDCARL_MDCLSYNC_POSN                     equ 0005h
MDCARL_MDCLSYNC_POSITION                 equ 0005h
MDCARL_MDCLSYNC_SIZE                     equ 0001h
MDCARL_MDCLSYNC_LENGTH                   equ 0001h
MDCARL_MDCLSYNC_MASK                     equ 0020h
MDCARL_MDCLPOL_POSN                      equ 0006h
MDCARL_MDCLPOL_POSITION                  equ 0006h
MDCARL_MDCLPOL_SIZE                      equ 0001h
MDCARL_MDCLPOL_LENGTH                    equ 0001h
MDCARL_MDCLPOL_MASK                      equ 0040h
MDCARL_MDCLODIS_POSN                     equ 0007h
MDCARL_MDCLODIS_POSITION                 equ 0007h
MDCARL_MDCLODIS_SIZE                     equ 0001h
MDCARL_MDCLODIS_LENGTH                   equ 0001h
MDCARL_MDCLODIS_MASK                     equ 0080h
MDCARL_MDCL0_POSN                        equ 0000h
MDCARL_MDCL0_POSITION                    equ 0000h
MDCARL_MDCL0_SIZE                        equ 0001h
MDCARL_MDCL0_LENGTH                      equ 0001h
MDCARL_MDCL0_MASK                        equ 0001h
MDCARL_MDCL1_POSN                        equ 0001h
MDCARL_MDCL1_POSITION                    equ 0001h
MDCARL_MDCL1_SIZE                        equ 0001h
MDCARL_MDCL1_LENGTH                      equ 0001h
MDCARL_MDCL1_MASK                        equ 0002h
MDCARL_MDCL2_POSN                        equ 0002h
MDCARL_MDCL2_POSITION                    equ 0002h
MDCARL_MDCL2_SIZE                        equ 0001h
MDCARL_MDCL2_LENGTH                      equ 0001h
MDCARL_MDCL2_MASK                        equ 0004h
MDCARL_MDCL3_POSN                        equ 0003h
MDCARL_MDCL3_POSITION                    equ 0003h
MDCARL_MDCL3_SIZE                        equ 0001h
MDCARL_MDCL3_LENGTH                      equ 0001h
MDCARL_MDCL3_MASK                        equ 0008h

// Register: MDCARH
#define MDCARH MDCARH
MDCARH                                   equ 0F43h
// bitfield definitions
MDCARH_MDCH_POSN                         equ 0000h
MDCARH_MDCH_POSITION                     equ 0000h
MDCARH_MDCH_SIZE                         equ 0004h
MDCARH_MDCH_LENGTH                       equ 0004h
MDCARH_MDCH_MASK                         equ 000Fh
MDCARH_MDCHSYNC_POSN                     equ 0005h
MDCARH_MDCHSYNC_POSITION                 equ 0005h
MDCARH_MDCHSYNC_SIZE                     equ 0001h
MDCARH_MDCHSYNC_LENGTH                   equ 0001h
MDCARH_MDCHSYNC_MASK                     equ 0020h
MDCARH_MDCHPOL_POSN                      equ 0006h
MDCARH_MDCHPOL_POSITION                  equ 0006h
MDCARH_MDCHPOL_SIZE                      equ 0001h
MDCARH_MDCHPOL_LENGTH                    equ 0001h
MDCARH_MDCHPOL_MASK                      equ 0040h
MDCARH_MDCHODIS_POSN                     equ 0007h
MDCARH_MDCHODIS_POSITION                 equ 0007h
MDCARH_MDCHODIS_SIZE                     equ 0001h
MDCARH_MDCHODIS_LENGTH                   equ 0001h
MDCARH_MDCHODIS_MASK                     equ 0080h
MDCARH_MDCH0_POSN                        equ 0000h
MDCARH_MDCH0_POSITION                    equ 0000h
MDCARH_MDCH0_SIZE                        equ 0001h
MDCARH_MDCH0_LENGTH                      equ 0001h
MDCARH_MDCH0_MASK                        equ 0001h
MDCARH_MDCH1_POSN                        equ 0001h
MDCARH_MDCH1_POSITION                    equ 0001h
MDCARH_MDCH1_SIZE                        equ 0001h
MDCARH_MDCH1_LENGTH                      equ 0001h
MDCARH_MDCH1_MASK                        equ 0002h
MDCARH_MDCH2_POSN                        equ 0002h
MDCARH_MDCH2_POSITION                    equ 0002h
MDCARH_MDCH2_SIZE                        equ 0001h
MDCARH_MDCH2_LENGTH                      equ 0001h
MDCARH_MDCH2_MASK                        equ 0004h
MDCARH_MDCH3_POSN                        equ 0003h
MDCARH_MDCH3_POSITION                    equ 0003h
MDCARH_MDCH3_SIZE                        equ 0001h
MDCARH_MDCH3_LENGTH                      equ 0001h
MDCARH_MDCH3_MASK                        equ 0008h

