GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k80.inc
// Register: MDSRC
#define MDSRC MDSRC
MDSRC                                    equ 0F44h
// bitfield definitions
MDSRC_MDSRC_POSN                         equ 0000h
MDSRC_MDSRC_POSITION                     equ 0000h
MDSRC_MDSRC_SIZE                         equ 0004h
MDSRC_MDSRC_LENGTH                       equ 0004h
MDSRC_MDSRC_MASK                         equ 000Fh
MDSRC_MDSODIS_POSN                       equ 0007h
MDSRC_MDSODIS_POSITION                   equ 0007h
MDSRC_MDSODIS_SIZE                       equ 0001h
MDSRC_MDSODIS_LENGTH                     equ 0001h
MDSRC_MDSODIS_MASK                       equ 0080h
MDSRC_MDSRC0_POSN                        equ 0000h
MDSRC_MDSRC0_POSITION                    equ 0000h
MDSRC_MDSRC0_SIZE                        equ 0001h
MDSRC_MDSRC0_LENGTH                      equ 0001h
MDSRC_MDSRC0_MASK                        equ 0001h
MDSRC_MDSRC1_POSN                        equ 0001h
MDSRC_MDSRC1_POSITION                    equ 0001h
MDSRC_MDSRC1_SIZE                        equ 0001h
MDSRC_MDSRC1_LENGTH                      equ 0001h
MDSRC_MDSRC1_MASK                        equ 0002h
MDSRC_MDSRC2_POSN                        equ 0002h
MDSRC_MDSRC2_POSITION                    equ 0002h
MDSRC_MDSRC2_SIZE                        equ 0001h
MDSRC_MDSRC2_LENGTH                      equ 0001h
MDSRC_MDSRC2_MASK                        equ 0004h
MDSRC_MDSRC3_POSN                        equ 0003h
MDSRC_MDSRC3_POSITION                    equ 0003h
MDSRC_MDSRC3_SIZE                        equ 0001h
MDSRC_MDSRC3_LENGTH                      equ 0001h
MDSRC_MDSRC3_MASK                        equ 0008h

// Register: MDCON
#define MDCON MDCON
MDCON                                    equ 0F45h
// bitfield definitions
MDCON_MDBIT_POSN                         equ 0000h
MDCON_MDBIT_POSITION                     equ 0000h
MDCON_MDBIT_SIZE                         equ 0001h
MDCON_MDBIT_LENGTH                       equ 0001h
MDCON_MDBIT_MASK                         equ 0001h
MDCON_MDO_POSN                           equ 0003h
MDCON_MDO_POSITION                       equ 0003h
MDCON_MDO_SIZE                           equ 0001h
MDCON_MDO_LENGTH                         equ 0001h
MDCON_MDO_MASK                           equ 0008h
MDCON_MDOPOL_POSN                        equ 0004h
MDCON_MDOPOL_POSITION                    equ 0004h
MDCON_MDOPOL_SIZE                        equ 0001h
MDCON_MDOPOL_LENGTH                      equ 0001h
MDCON_MDOPOL_MASK                        equ 0010h
MDCON_MDSLR_POSN                         equ 0005h
MDCON_MDSLR_POSITION                     equ 0005h
MDCON_MDSLR_SIZE                         equ 0001h
MDCON_MDSLR_LENGTH                       equ 0001h
MDCON_MDSLR_MASK                         equ 0020h
MDCON_MDOE_POSN                          equ 0006h
MDCON_MDOE_POSITION                      equ 0006h
MDCON_MDOE_SIZE                          equ 0001h
MDCON_MDOE_LENGTH                        equ 0001h
MDCON_MDOE_MASK                          equ 0040h
MDCON_MDEN_POSN                          equ 0007h
MDCON_MDEN_POSITION                      equ 0007h
MDCON_MDEN_SIZE                          equ 0001h
MDCON_MDEN_LENGTH                        equ 0001h
MDCON_MDEN_MASK                          equ 0080h

// Register: PSPCON
#define PSPCON PSPCON
PSPCON                                   equ 0F46h
// bitfield definitions
PSPCON_PSPMODE_POSN                      equ 0004h
PSPCON_PSPMODE_POSITION                  equ 0004h
PSPCON_PSPMODE_SIZE                      equ 0001h
PSPCON_PSPMODE_LENGTH                    equ 0001h
PSPCON_PSPMODE_MASK                      equ 0010h
PSPCON_IBOV_POSN                         equ 0005h
PSPCON_IBOV_POSITION                     equ 0005h
PSPCON_IBOV_SIZE                         equ 0001h
PSPCON_IBOV_LENGTH                       equ 0001h
PSPCON_IBOV_MASK                         equ 0020h
PSPCON_OBF_POSN                          equ 0006h
PSPCON_OBF_POSITION                      equ 0006h
PSPCON_OBF_SIZE                          equ 0001h
PSPCON_OBF_LENGTH                        equ 0001h
PSPCON_OBF_MASK                          equ 0040h
PSPCON_IBF_POSN                          equ 0007h
PSPCON_IBF_POSITION                      equ 0007h
PSPCON_IBF_SIZE                          equ 0001h
PSPCON_IBF_LENGTH                        equ 0001h
PSPCON_IBF_MASK                          equ 0080h

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 0F47h
// bitfield definitions
CCP5CON_CCP5M_POSN                       equ 0000h
CCP5CON_CCP5M_POSITION                   equ 0000h
CCP5CON_CCP5M_SIZE                       equ 0004h
CCP5CON_CCP5M_LENGTH                     equ 0004h
CCP5CON_CCP5M_MASK                       equ 000Fh
CCP5CON_DC5B_POSN                        equ 0004h
CCP5CON_DC5B_POSITION                    equ 0004h
CCP5CON_DC5B_SIZE                        equ 0002h
CCP5CON_DC5B_LENGTH                      equ 0002h
CCP5CON_DC5B_MASK                        equ 0030h
CCP5CON_CCP5M0_POSN                      equ 0000h
CCP5CON_CCP5M0_POSITION                  equ 0000h
CCP5CON_CCP5M0_SIZE                      equ 0001h
CCP5CON_CCP5M0_LENGTH                    equ 0001h
CCP5CON_CCP5M0_MASK                      equ 0001h
CCP5CON_CCP5M1_POSN                      equ 0001h
CCP5CON_CCP5M1_POSITION                  equ 0001h
CCP5CON_CCP5M1_SIZE                      equ 0001h
CCP5CON_CCP5M1_LENGTH                    equ 0001h
CCP5CON_CCP5M1_MASK                      equ 0002h
CCP5CON_CCP5M2_POSN                      equ 0002h
CCP5CON_CCP5M2_POSITION                  equ 0002h
CCP5CON_CCP5M2_SIZE                      equ 0001h
CCP5CON_CCP5M2_LENGTH                    equ 0001h
CCP5CON_CCP5M2_MASK                      equ 0004h
CCP5CON_CCP5M3_POSN                      equ 0003h
CCP5CON_CCP5M3_POSITION                  equ 0003h
CCP5CON_CCP5M3_SIZE                      equ 0001h
CCP5CON_CCP5M3_LENGTH                    equ 0001h
CCP5CON_CCP5M3_MASK                      equ 0008h
CCP5CON_DC5B0_POSN                       equ 0004h
CCP5CON_DC5B0_POSITION                   equ 0004h
CCP5CON_DC5B0_SIZE                       equ 0001h
CCP5CON_DC5B0_LENGTH                     equ 0001h
CCP5CON_DC5B0_MASK                       equ 0010h
CCP5CON_DC5B1_POSN                       equ 0005h
CCP5CON_DC5B1_POSITION                   equ 0005h
CCP5CON_DC5B1_SIZE                       equ 0001h
CCP5CON_DC5B1_LENGTH                     equ 0001h
CCP5CON_DC5B1_MASK                       equ 0020h
CCP5CON_CCP5Y_POSN                       equ 0004h
CCP5CON_CCP5Y_POSITION                   equ 0004h
CCP5CON_CCP5Y_SIZE                       equ 0001h
CCP5CON_CCP5Y_LENGTH                     equ 0001h
CCP5CON_CCP5Y_MASK                       equ 0010h
CCP5CON_CCP5X_POSN                       equ 0005h
CCP5CON_CCP5X_POSITION                   equ 0005h
CCP5CON_CCP5X_SIZE                       equ 0001h
CCP5CON_CCP5X_LENGTH                     equ 0001h
CCP5CON_CCP5X_MASK                       equ 0020h

