GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k80.inc
#define RXF10EID8                        BANKMASK(RXF10EIDH), 0, b
#define RXF10EID9                        BANKMASK(RXF10EIDH), 1, b
#define RXF10EN                          BANKMASK(RXFCON1), 2, b
#define RXF10EXIDEN                      BANKMASK(RXF10SIDL), 3, b
#define RXF10SID0                        BANKMASK(RXF10SIDL), 5, b
#define RXF10SID1                        BANKMASK(RXF10SIDL), 6, b
#define RXF10SID10                       BANKMASK(RXF10SIDH), 7, b
#define RXF10SID2                        BANKMASK(RXF10SIDL), 7, b
#define RXF10SID3                        BANKMASK(RXF10SIDH), 0, b
#define RXF10SID4                        BANKMASK(RXF10SIDH), 1, b
#define RXF10SID5                        BANKMASK(RXF10SIDH), 2, b
#define RXF10SID6                        BANKMASK(RXF10SIDH), 3, b
#define RXF10SID7                        BANKMASK(RXF10SIDH), 4, b
#define RXF10SID8                        BANKMASK(RXF10SIDH), 5, b
#define RXF10SID9                        BANKMASK(RXF10SIDH), 6, b
#define RXF11EID0                        BANKMASK(RXF11EIDL), 0, b
#define RXF11EID1                        BANKMASK(RXF11EIDL), 1, b
#define RXF11EID10                       BANKMASK(RXF11EIDH), 2, b
#define RXF11EID11                       BANKMASK(RXF11EIDH), 3, b
#define RXF11EID12                       BANKMASK(RXF11EIDH), 4, b
#define RXF11EID13                       BANKMASK(RXF11EIDH), 5, b
#define RXF11EID14                       BANKMASK(RXF11EIDH), 6, b
#define RXF11EID15                       BANKMASK(RXF11EIDH), 7, b
#define RXF11EID16                       BANKMASK(RXF11SIDL), 0, b
#define RXF11EID17                       BANKMASK(RXF11SIDL), 1, b
#define RXF11EID2                        BANKMASK(RXF11EIDL), 2, b
#define RXF11EID3                        BANKMASK(RXF11EIDL), 3, b
#define RXF11EID4                        BANKMASK(RXF11EIDL), 4, b
#define RXF11EID5                        BANKMASK(RXF11EIDL), 5, b
#define RXF11EID6                        BANKMASK(RXF11EIDL), 6, b
#define RXF11EID7                        BANKMASK(RXF11EIDL), 7, b
#define RXF11EID8                        BANKMASK(RXF11EIDH), 0, b
#define RXF11EID9                        BANKMASK(RXF11EIDH), 1, b
#define RXF11EN                          BANKMASK(RXFCON1), 3, b
#define RXF11EXIDEN                      BANKMASK(RXF11SIDL), 3, b
#define RXF11SID0                        BANKMASK(RXF11SIDL), 5, b
#define RXF11SID1                        BANKMASK(RXF11SIDL), 6, b
#define RXF11SID10                       BANKMASK(RXF11SIDH), 7, b
#define RXF11SID2                        BANKMASK(RXF11SIDL), 7, b
#define RXF11SID3                        BANKMASK(RXF11SIDH), 0, b
#define RXF11SID4                        BANKMASK(RXF11SIDH), 1, b
#define RXF11SID5                        BANKMASK(RXF11SIDH), 2, b
#define RXF11SID6                        BANKMASK(RXF11SIDH), 3, b
#define RXF11SID7                        BANKMASK(RXF11SIDH), 4, b
#define RXF11SID8                        BANKMASK(RXF11SIDH), 5, b
#define RXF11SID9                        BANKMASK(RXF11SIDH), 6, b
#define RXF12EID0                        BANKMASK(RXF12EIDL), 0, b
#define RXF12EID1                        BANKMASK(RXF12EIDL), 1, b
#define RXF12EID10                       BANKMASK(RXF12EIDH), 2, b
#define RXF12EID11                       BANKMASK(RXF12EIDH), 3, b
#define RXF12EID12                       BANKMASK(RXF12EIDH), 4, b
#define RXF12EID13                       BANKMASK(RXF12EIDH), 5, b
#define RXF12EID14                       BANKMASK(RXF12EIDH), 6, b
#define RXF12EID15                       BANKMASK(RXF12EIDH), 7, b
#define RXF12EID16                       BANKMASK(RXF12SIDL), 0, b
#define RXF12EID17                       BANKMASK(RXF12SIDL), 1, b
#define RXF12EID2                        BANKMASK(RXF12EIDL), 2, b
#define RXF12EID3                        BANKMASK(RXF12EIDL), 3, b
#define RXF12EID4                        BANKMASK(RXF12EIDL), 4, b
#define RXF12EID5                        BANKMASK(RXF12EIDL), 5, b
#define RXF12EID6                        BANKMASK(RXF12EIDL), 6, b
#define RXF12EID7                        BANKMASK(RXF12EIDL), 7, b
#define RXF12EID8                        BANKMASK(RXF12EIDH), 0, b
#define RXF12EID9                        BANKMASK(RXF12EIDH), 1, b
#define RXF12EN                          BANKMASK(RXFCON1), 4, b
#define RXF12EXIDEN                      BANKMASK(RXF12SIDL), 3, b
#define RXF12SID0                        BANKMASK(RXF12SIDL), 5, b
#define RXF12SID1                        BANKMASK(RXF12SIDL), 6, b
#define RXF12SID10                       BANKMASK(RXF12SIDH), 7, b
#define RXF12SID2                        BANKMASK(RXF12SIDL), 7, b
#define RXF12SID3                        BANKMASK(RXF12SIDH), 0, b
#define RXF12SID4                        BANKMASK(RXF12SIDH), 1, b
#define RXF12SID5                        BANKMASK(RXF12SIDH), 2, b
#define RXF12SID6                        BANKMASK(RXF12SIDH), 3, b
#define RXF12SID7                        BANKMASK(RXF12SIDH), 4, b
#define RXF12SID8                        BANKMASK(RXF12SIDH), 5, b
#define RXF12SID9                        BANKMASK(RXF12SIDH), 6, b
#define RXF13EID0                        BANKMASK(RXF13EIDL), 0, b
#define RXF13EID1                        BANKMASK(RXF13EIDL), 1, b
#define RXF13EID10                       BANKMASK(RXF13EIDH), 2, b
#define RXF13EID11                       BANKMASK(RXF13EIDH), 3, b
#define RXF13EID12                       BANKMASK(RXF13EIDH), 4, b
#define RXF13EID13                       BANKMASK(RXF13EIDH), 5, b
#define RXF13EID14                       BANKMASK(RXF13EIDH), 6, b
#define RXF13EID15                       BANKMASK(RXF13EIDH), 7, b
#define RXF13EID16                       BANKMASK(RXF13SIDL), 0, b
#define RXF13EID17                       BANKMASK(RXF13SIDL), 1, b
#define RXF13EID2                        BANKMASK(RXF13EIDL), 2, b
#define RXF13EID3                        BANKMASK(RXF13EIDL), 3, b
#define RXF13EID4                        BANKMASK(RXF13EIDL), 4, b
#define RXF13EID5                        BANKMASK(RXF13EIDL), 5, b
#define RXF13EID6                        BANKMASK(RXF13EIDL), 6, b
#define RXF13EID7                        BANKMASK(RXF13EIDL), 7, b
#define RXF13EID8                        BANKMASK(RXF13EIDH), 0, b
#define RXF13EID9                        BANKMASK(RXF13EIDH), 1, b
#define RXF13EN                          BANKMASK(RXFCON1), 5, b
#define RXF13EXIDEN                      BANKMASK(RXF13SIDL), 3, b
#define RXF13SID0                        BANKMASK(RXF13SIDL), 5, b
#define RXF13SID1                        BANKMASK(RXF13SIDL), 6, b
#define RXF13SID10                       BANKMASK(RXF13SIDH), 7, b
#define RXF13SID2                        BANKMASK(RXF13SIDL), 7, b
#define RXF13SID3                        BANKMASK(RXF13SIDH), 0, b
#define RXF13SID4                        BANKMASK(RXF13SIDH), 1, b
#define RXF13SID5                        BANKMASK(RXF13SIDH), 2, b
#define RXF13SID6                        BANKMASK(RXF13SIDH), 3, b
#define RXF13SID7                        BANKMASK(RXF13SIDH), 4, b
#define RXF13SID8                        BANKMASK(RXF13SIDH), 5, b
#define RXF13SID9                        BANKMASK(RXF13SIDH), 6, b
#define RXF14EID0                        BANKMASK(RXF14EIDL), 0, b
#define RXF14EID1                        BANKMASK(RXF14EIDL), 1, b
#define RXF14EID10                       BANKMASK(RXF14EIDH), 2, b
#define RXF14EID11                       BANKMASK(RXF14EIDH), 3, b
#define RXF14EID12                       BANKMASK(RXF14EIDH), 4, b
#define RXF14EID13                       BANKMASK(RXF14EIDH), 5, b
#define RXF14EID14                       BANKMASK(RXF14EIDH), 6, b
#define RXF14EID15                       BANKMASK(RXF14EIDH), 7, b
#define RXF14EID16                       BANKMASK(RXF14SIDL), 0, b
#define RXF14EID17                       BANKMASK(RXF14SIDL), 1, b
#define RXF14EID2                        BANKMASK(RXF14EIDL), 2, b
#define RXF14EID3                        BANKMASK(RXF14EIDL), 3, b
#define RXF14EID4                        BANKMASK(RXF14EIDL), 4, b
#define RXF14EID5                        BANKMASK(RXF14EIDL), 5, b
#define RXF14EID6                        BANKMASK(RXF14EIDL), 6, b
#define RXF14EID7                        BANKMASK(RXF14EIDL), 7, b
#define RXF14EID8                        BANKMASK(RXF14EIDH), 0, b
#define RXF14EID9                        BANKMASK(RXF14EIDH), 1, b
#define RXF14EN                          BANKMASK(RXFCON1), 6, b
#define RXF14EXIDEN                      BANKMASK(RXF14SIDL), 3, b
#define RXF14SID0                        BANKMASK(RXF14SIDL), 5, b
#define RXF14SID1                        BANKMASK(RXF14SIDL), 6, b
#define RXF14SID10                       BANKMASK(RXF14SIDH), 7, b
#define RXF14SID2                        BANKMASK(RXF14SIDL), 7, b
#define RXF14SID3                        BANKMASK(RXF14SIDH), 0, b
#define RXF14SID4                        BANKMASK(RXF14SIDH), 1, b
#define RXF14SID5                        BANKMASK(RXF14SIDH), 2, b
#define RXF14SID6                        BANKMASK(RXF14SIDH), 3, b
#define RXF14SID7                        BANKMASK(RXF14SIDH), 4, b
#define RXF14SID8                        BANKMASK(RXF14SIDH), 5, b
#define RXF14SID9                        BANKMASK(RXF14SIDH), 6, b
#define RXF15EID0                        BANKMASK(RXF15EIDL), 0, b
#define RXF15EID1                        BANKMASK(RXF15EIDL), 1, b
#define RXF15EID10                       BANKMASK(RXF15EIDH), 2, b
#define RXF15EID11                       BANKMASK(RXF15EIDH), 3, b
#define RXF15EID12                       BANKMASK(RXF15EIDH), 4, b
#define RXF15EID13                       BANKMASK(RXF15EIDH), 5, b
#define RXF15EID14                       BANKMASK(RXF15EIDH), 6, b
#define RXF15EID15                       BANKMASK(RXF15EIDH), 7, b
#define RXF15EID16                       BANKMASK(RXF15SIDL), 0, b
#define RXF15EID17                       BANKMASK(RXF15SIDL), 1, b
#define RXF15EID2                        BANKMASK(RXF15EIDL), 2, b
#define RXF15EID3                        BANKMASK(RXF15EIDL), 3, b
#define RXF15EID4                        BANKMASK(RXF15EIDL), 4, b
#define RXF15EID5                        BANKMASK(RXF15EIDL), 5, b
#define RXF15EID6                        BANKMASK(RXF15EIDL), 6, b
#define RXF15EID7                        BANKMASK(RXF15EIDL), 7, b
#define RXF15EID8                        BANKMASK(RXF15EIDH), 0, b
#define RXF15EID9                        BANKMASK(RXF15EIDH), 1, b
#define RXF15EN                          BANKMASK(RXFCON1), 7, b
#define RXF15EXIDEN                      BANKMASK(RXF15SIDL), 3, b
#define RXF15SID0                        BANKMASK(RXF15SIDL), 5, b
#define RXF15SID1                        BANKMASK(RXF15SIDL), 6, b
#define RXF15SID10                       BANKMASK(RXF15SIDH), 7, b
#define RXF15SID2                        BANKMASK(RXF15SIDL), 7, b
#define RXF15SID3                        BANKMASK(RXF15SIDH), 0, b
#define RXF15SID4                        BANKMASK(RXF15SIDH), 1, b
#define RXF15SID5                        BANKMASK(RXF15SIDH), 2, b
#define RXF15SID6                        BANKMASK(RXF15SIDH), 3, b
#define RXF15SID7                        BANKMASK(RXF15SIDH), 4, b
#define RXF15SID8                        BANKMASK(RXF15SIDH), 5, b
#define RXF15SID9                        BANKMASK(RXF15SIDH), 6, b
#define RXF1EID0                         BANKMASK(RXF1EIDL), 0, b
#define RXF1EID1                         BANKMASK(RXF1EIDL), 1, b
#define RXF1EID10                        BANKMASK(RXF1EIDH), 2, b
#define RXF1EID11                        BANKMASK(RXF1EIDH), 3, b
#define RXF1EID12                        BANKMASK(RXF1EIDH), 4, b
#define RXF1EID13                        BANKMASK(RXF1EIDH), 5, b
#define RXF1EID14                        BANKMASK(RXF1EIDH), 6, b
#define RXF1EID15                        BANKMASK(RXF1EIDH), 7, b
#define RXF1EID16                        BANKMASK(RXF1SIDL), 0, b
#define RXF1EID17                        BANKMASK(RXF1SIDL), 1, b
#define RXF1EID2                         BANKMASK(RXF1EIDL), 2, b
#define RXF1EID3                         BANKMASK(RXF1EIDL), 3, b
#define RXF1EID4                         BANKMASK(RXF1EIDL), 4, b
#define RXF1EID5                         BANKMASK(RXF1EIDL), 5, b
#define RXF1EID6                         BANKMASK(RXF1EIDL), 6, b
#define RXF1EID7                         BANKMASK(RXF1EIDL), 7, b
#define RXF1EID8                         BANKMASK(RXF1EIDH), 0, b
#define RXF1EID9                         BANKMASK(RXF1EIDH), 1, b
#define RXF1EN                           BANKMASK(RXFCON0), 1, b
#define RXF1EXIDEN                       BANKMASK(RXF1SIDL), 3, b
#define RXF1SID0                         BANKMASK(RXF1SIDL), 5, b
#define RXF1SID1                         BANKMASK(RXF1SIDL), 6, b
#define RXF1SID10                        BANKMASK(RXF1SIDH), 7, b
#define RXF1SID2                         BANKMASK(RXF1SIDL), 7, b
#define RXF1SID3                         BANKMASK(RXF1SIDH), 0, b
#define RXF1SID4                         BANKMASK(RXF1SIDH), 1, b
#define RXF1SID5                         BANKMASK(RXF1SIDH), 2, b
#define RXF1SID6                         BANKMASK(RXF1SIDH), 3, b
#define RXF1SID7                         BANKMASK(RXF1SIDH), 4, b
#define RXF1SID8                         BANKMASK(RXF1SIDH), 5, b
#define RXF1SID9                         BANKMASK(RXF1SIDH), 6, b
#define RXF2EID0                         BANKMASK(RXF2EIDL), 0, b
#define RXF2EID1                         BANKMASK(RXF2EIDL), 1, b
#define RXF2EID10                        BANKMASK(RXF2EIDH), 2, b
#define RXF2EID11                        BANKMASK(RXF2EIDH), 3, b
#define RXF2EID12                        BANKMASK(RXF2EIDH), 4, b
#define RXF2EID13                        BANKMASK(RXF2EIDH), 5, b
#define RXF2EID14                        BANKMASK(RXF2EIDH), 6, b
#define RXF2EID15                        BANKMASK(RXF2EIDH), 7, b
#define RXF2EID16                        BANKMASK(RXF2SIDL), 0, b
#define RXF2EID17                        BANKMASK(RXF2SIDL), 1, b
#define RXF2EID2                         BANKMASK(RXF2EIDL), 2, b
#define RXF2EID3                         BANKMASK(RXF2EIDL), 3, b
#define RXF2EID4                         BANKMASK(RXF2EIDL), 4, b
#define RXF2EID5                         BANKMASK(RXF2EIDL), 5, b
#define RXF2EID6                         BANKMASK(RXF2EIDL), 6, b
#define RXF2EID7                         BANKMASK(RXF2EIDL), 7, b
#define RXF2EID8                         BANKMASK(RXF2EIDH), 0, b
#define RXF2EID9                         BANKMASK(RXF2EIDH), 1, b
#define RXF2EN                           BANKMASK(RXFCON0), 2, b
#define RXF2EXIDEN                       BANKMASK(RXF2SIDL), 3, b
#define RXF2SID0                         BANKMASK(RXF2SIDL), 5, b
#define RXF2SID1                         BANKMASK(RXF2SIDL), 6, b
#define RXF2SID10                        BANKMASK(RXF2SIDH), 7, b
#define RXF2SID2                         BANKMASK(RXF2SIDL), 7, b
#define RXF2SID3                         BANKMASK(RXF2SIDH), 0, b
#define RXF2SID4                         BANKMASK(RXF2SIDH), 1, b
#define RXF2SID5                         BANKMASK(RXF2SIDH), 2, b
#define RXF2SID6                         BANKMASK(RXF2SIDH), 3, b
#define RXF2SID7                         BANKMASK(RXF2SIDH), 4, b
#define RXF2SID8                         BANKMASK(RXF2SIDH), 5, b
#define RXF2SID9                         BANKMASK(RXF2SIDH), 6, b
#define RXF3EID0                         BANKMASK(RXF3EIDL), 0, b
#define RXF3EID1                         BANKMASK(RXF3EIDL), 1, b
#define RXF3EID10                        BANKMASK(RXF3EIDH), 2, b
#define RXF3EID11                        BANKMASK(RXF3EIDH), 3, b
#define RXF3EID12                        BANKMASK(RXF3EIDH), 4, b
#define RXF3EID13                        BANKMASK(RXF3EIDH), 5, b
#define RXF3EID14                        BANKMASK(RXF3EIDH), 6, b
#define RXF3EID15                        BANKMASK(RXF3EIDH), 7, b
#define RXF3EID16                        BANKMASK(RXF3SIDL), 0, b
#define RXF3EID17                        BANKMASK(RXF3SIDL), 1, b
#define RXF3EID2                         BANKMASK(RXF3EIDL), 2, b
#define RXF3EID3                         BANKMASK(RXF3EIDL), 3, b
#define RXF3EID4                         BANKMASK(RXF3EIDL), 4, b
#define RXF3EID5                         BANKMASK(RXF3EIDL), 5, b
#define RXF3EID6                         BANKMASK(RXF3EIDL), 6, b
#define RXF3EID7                         BANKMASK(RXF3EIDL), 7, b
#define RXF3EID8                         BANKMASK(RXF3EIDH), 0, b
#define RXF3EID9                         BANKMASK(RXF3EIDH), 1, b
#define RXF3EN                           BANKMASK(RXFCON0), 3, b
#define RXF3EXIDEN                       BANKMASK(RXF3SIDL), 3, b
#define RXF3SID0                         BANKMASK(RXF3SIDL), 5, b
#define RXF3SID1                         BANKMASK(RXF3SIDL), 6, b
#define RXF3SID10                        BANKMASK(RXF3SIDH), 7, b
#define RXF3SID2                         BANKMASK(RXF3SIDL), 7, b
#define RXF3SID3                         BANKMASK(RXF3SIDH), 0, b
#define RXF3SID4                         BANKMASK(RXF3SIDH), 1, b
#define RXF3SID5                         BANKMASK(RXF3SIDH), 2, b
#define RXF3SID6                         BANKMASK(RXF3SIDH), 3, b
#define RXF3SID7                         BANKMASK(RXF3SIDH), 4, b
#define RXF3SID8                         BANKMASK(RXF3SIDH), 5, b
#define RXF3SID9                         BANKMASK(RXF3SIDH), 6, b
#define RXF4EID0                         BANKMASK(RXF4EIDL), 0, b
#define RXF4EID1                         BANKMASK(RXF4EIDL), 1, b
#define RXF4EID10                        BANKMASK(RXF4EIDH), 2, b
#define RXF4EID11                        BANKMASK(RXF4EIDH), 3, b
#define RXF4EID12                        BANKMASK(RXF4EIDH), 4, b
#define RXF4EID13                        BANKMASK(RXF4EIDH), 5, b
#define RXF4EID14                        BANKMASK(RXF4EIDH), 6, b
#define RXF4EID15                        BANKMASK(RXF4EIDH), 7, b
#define RXF4EID16                        BANKMASK(RXF4SIDL), 0, b
#define RXF4EID17                        BANKMASK(RXF4SIDL), 1, b
#define RXF4EID2                         BANKMASK(RXF4EIDL), 2, b
#define RXF4EID3                         BANKMASK(RXF4EIDL), 3, b
#define RXF4EID4                         BANKMASK(RXF4EIDL), 4, b
#define RXF4EID5                         BANKMASK(RXF4EIDL), 5, b
#define RXF4EID6                         BANKMASK(RXF4EIDL), 6, b
#define RXF4EID7                         BANKMASK(RXF4EIDL), 7, b
#define RXF4EID8                         BANKMASK(RXF4EIDH), 0, b
#define RXF4EID9                         BANKMASK(RXF4EIDH), 1, b
#define RXF4EN                           BANKMASK(RXFCON0), 4, b
#define RXF4EXIDEN                       BANKMASK(RXF4SIDL), 3, b
#define RXF4SID0                         BANKMASK(RXF4SIDL), 5, b
#define RXF4SID1                         BANKMASK(RXF4SIDL), 6, b
#define RXF4SID10                        BANKMASK(RXF4SIDH), 7, b
#define RXF4SID2                         BANKMASK(RXF4SIDL), 7, b
#define RXF4SID3                         BANKMASK(RXF4SIDH), 0, b
#define RXF4SID4                         BANKMASK(RXF4SIDH), 1, b
#define RXF4SID5                         BANKMASK(RXF4SIDH), 2, b
#define RXF4SID6                         BANKMASK(RXF4SIDH), 3, b
#define RXF4SID7                         BANKMASK(RXF4SIDH), 4, b
#define RXF4SID8                         BANKMASK(RXF4SIDH), 5, b
#define RXF4SID9                         BANKMASK(RXF4SIDH), 6, b
#define RXF5EID0                         BANKMASK(RXF5EIDL), 0, b
#define RXF5EID1                         BANKMASK(RXF5EIDL), 1, b
#define RXF5EID10                        BANKMASK(RXF5EIDH), 2, b
#define RXF5EID11                        BANKMASK(RXF5EIDH), 3, b
#define RXF5EID12                        BANKMASK(RXF5EIDH), 4, b
#define RXF5EID13                        BANKMASK(RXF5EIDH), 5, b
#define RXF5EID14                        BANKMASK(RXF5EIDH), 6, b
#define RXF5EID15                        BANKMASK(RXF5EIDH), 7, b
#define RXF5EID16                        BANKMASK(RXF5SIDL), 0, b
#define RXF5EID17                        BANKMASK(RXF5SIDL), 1, b
#define RXF5EID2                         BANKMASK(RXF5EIDL), 2, b
#define RXF5EID3                         BANKMASK(RXF5EIDL), 3, b
#define RXF5EID4                         BANKMASK(RXF5EIDL), 4, b
#define RXF5EID5                         BANKMASK(RXF5EIDL), 5, b
#define RXF5EID6                         BANKMASK(RXF5EIDL), 6, b
#define RXF5EID7                         BANKMASK(RXF5EIDL), 7, b
#define RXF5EID8                         BANKMASK(RXF5EIDH), 0, b
#define RXF5EID9                         BANKMASK(RXF5EIDH), 1, b
#define RXF5EN                           BANKMASK(RXFCON0), 5, b
#define RXF5EXIDEN                       BANKMASK(RXF5SIDL), 3, b
#define RXF5SID0                         BANKMASK(RXF5SIDL), 5, b
#define RXF5SID1                         BANKMASK(RXF5SIDL), 6, b
#define RXF5SID10                        BANKMASK(RXF5SIDH), 7, b
#define RXF5SID2                         BANKMASK(RXF5SIDL), 7, b
#define RXF5SID3                         BANKMASK(RXF5SIDH), 0, b
#define RXF5SID4                         BANKMASK(RXF5SIDH), 1, b
#define RXF5SID5                         BANKMASK(RXF5SIDH), 2, b
#define RXF5SID6                         BANKMASK(RXF5SIDH), 3, b
#define RXF5SID7                         BANKMASK(RXF5SIDH), 4, b
#define RXF5SID8                         BANKMASK(RXF5SIDH), 5, b
#define RXF5SID9                         BANKMASK(RXF5SIDH), 6, b
#define RXF6EID0                         BANKMASK(RXF6EIDL), 0, b
#define RXF6EID1                         BANKMASK(RXF6EIDL), 1, b
#define RXF6EID10                        BANKMASK(RXF6EIDH), 2, b
#define RXF6EID11                        BANKMASK(RXF6EIDH), 3, b
#define RXF6EID12                        BANKMASK(RXF6EIDH), 4, b
#define RXF6EID13                        BANKMASK(RXF6EIDH), 5, b
#define RXF6EID14                        BANKMASK(RXF6EIDH), 6, b
#define RXF6EID15                        BANKMASK(RXF6EIDH), 7, b
#define RXF6EID16                        BANKMASK(RXF6SIDL), 0, b
#define RXF6EID17                        BANKMASK(RXF6SIDL), 1, b
#define RXF6EID2                         BANKMASK(RXF6EIDL), 2, b
#define RXF6EID3                         BANKMASK(RXF6EIDL), 3, b
#define RXF6EID4                         BANKMASK(RXF6EIDL), 4, b
#define RXF6EID5                         BANKMASK(RXF6EIDL), 5, b
#define RXF6EID6                         BANKMASK(RXF6EIDL), 6, b
#define RXF6EID7                         BANKMASK(RXF6EIDL), 7, b
#define RXF6EID8                         BANKMASK(RXF6EIDH), 0, b
#define RXF6EID9                         BANKMASK(RXF6EIDH), 1, b
#define RXF6EN                           BANKMASK(RXFCON0), 6, b
#define RXF6EXIDEN                       BANKMASK(RXF6SIDL), 3, b
#define RXF6SID0                         BANKMASK(RXF6SIDL), 5, b
#define RXF6SID1                         BANKMASK(RXF6SIDL), 6, b
#define RXF6SID10                        BANKMASK(RXF6SIDH), 7, b
#define RXF6SID2                         BANKMASK(RXF6SIDL), 7, b
#define RXF6SID3                         BANKMASK(RXF6SIDH), 0, b
#define RXF6SID4                         BANKMASK(RXF6SIDH), 1, b
#define RXF6SID5                         BANKMASK(RXF6SIDH), 2, b
#define RXF6SID6                         BANKMASK(RXF6SIDH), 3, b
#define RXF6SID7                         BANKMASK(RXF6SIDH), 4, b
#define RXF6SID8                         BANKMASK(RXF6SIDH), 5, b
#define RXF6SID9                         BANKMASK(RXF6SIDH), 6, b
#define RXF7EID0                         BANKMASK(RXF7EIDL), 0, b
#define RXF7EID1                         BANKMASK(RXF7EIDL), 1, b
#define RXF7EID10                        BANKMASK(RXF7EIDH), 2, b
#define RXF7EID11                        BANKMASK(RXF7EIDH), 3, b
#define RXF7EID12                        BANKMASK(RXF7EIDH), 4, b
